docs/content-org/doc.org
#+STARTUP: content
#+AUTHOR: Iris Garcia
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+OPTIONS: toc:nil

*** Requirements
:PROPERTIES:
:EXPORT_FILE_NAME: dev/requirements
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :asciinema true
:EXPORT_HUGO_WEIGHT: 2
:END:
**** Go
- *Version used*: 1.13.1
- *Setup*: Most of the linux distributions provide a package to
  install Go, but it is also possible to download its binary.
  #+begin_src bash
  wget https://dl.google.com/go/go1.13.3.src.tar.gz
  tar -C /usr/local -xzf go1.13.3.src.tar.gz
  export PATH=$PATH:/usr/local/go/bin
  #+end_src
**** Mage
- *Setup*: Once go is installed, we can install mage as follows
  #+begin_src bash
  go get github.com/magefile/mage
  #+end_src
**** MariaDB
- *Version used*: 10.4
- *Setup*: Most of the linux distrubutions provide a package to
  install MariaDB, but if docker is installed the following command
  will spawn a MariaDB container:
  #+begin_src bash
  mage startdev
  #+end_src
**** Nodejs (Production)
- *Version used*: 12.11.1
- Nodejs is only needed to install *PM2* and therefore it is not a
  requirement, however the current state of the project uses it to run
  the service in a production environment.

